Documents/ВозвратКниг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Document>
		<Properties>
			<Name>ВозвратКниг</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Читатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Читатели</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокКниг</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Книга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Книги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Стелаж</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Стелажи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Полка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/Стелажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Catalog>
		<Properties>
			<Name>Стелажи</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Полки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>15</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/ВозвратКниг/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура СписокКнигПолкаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Стелаж = Элементы.СписокКниг.ТекущиеДанные.Стелаж;
	
	СписокПолок = ПолучитьСписокПолок(Стелаж);
	
	Элемент.СписокВыбора.Очистить(); 
	Для Каждого Полка Из СписокПолок Цикл 
		Элемент.СписокВыбора.Добавить(Полка);
	КонецЦикла;

КонецПроцедуры


// Функция - Получает список полок из
//  выбранного Стелажа
//
// Параметры:
//  Стелаж - 	 -Справочник Стелажи 
// 
// Возвращаемое значение:
//  Результат -  список значений
//
&НаСервере
Функция ПолучитьСписокПолок(Стелаж)  
	Результат = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтелажиПолки.Наименование КАК Наименование
		|ИЗ
		|	Справочник.Стелажи.Полки КАК СтелажиПолки
		|ГДЕ
		|	СтелажиПолки.Ссылка = &Стелаж";
	
	Запрос.УстановитьПараметр("Стелаж", Стелаж);
	
	Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Наименование");
	
  Возврат Результат;
КонецФункции
